In [4]:
import pandas as pd

# Creating the data with the name 'Books'
data = pd.DataFrame({
    "Author": ["Tolkien", "Orwell", "Woolf", "Hemingway"],
    "Books": [15, 9, 12, 11],
    "Genre": ["Fantasy", "Dystopian", "Modernist", "Realist"]
})

data

      Author  Books      Genre
0    Tolkien     15    Fantasy
1     Orwell      9  Dystopian
2      Woolf     12  Modernist
3  Hemingway     11    Realist

In [5]:
# Multiplying the 'Books' column by 10
data['Points'] = data['Books'].apply(lambda x: x * 10)
data

      Author  Books      Genre  Points
0    Tolkien     15    Fantasy     150
1     Orwell      9  Dystopian      90
2      Woolf     12  Modernist     120
3  Hemingway     11    Realist     110

In [8]:
# Multiplying Books by 2 using lambda
data['Double_Books'] = data['Books'].apply(lambda x: x * 2)
data

      Author  Books      Genre  Points  Double_Books
0    Tolkien     15    Fantasy     150            30
1     Orwell      9  Dystopian      90            18
2      Woolf     12  Modernist     120            24
3  Hemingway     11    Realist     110            22

In [9]:
# If Genre is 'Fantasy', label it 'Magic', else 'Reality'
data['Setting'] = data['Genre'].apply(lambda x: 'Magic' if x == 'Fantasy' else 'Reality')
data

      Author  Books      Genre  Points  Double_Books  Setting
0    Tolkien     15    Fantasy     150            30    Magic
1     Orwell      9  Dystopian      90            18  Reality
2      Woolf     12  Modernist     120            24  Reality
3  Hemingway     11    Realist     110            22  Reality